[Killed] BlockStatement
src/component/Button.js:13:23
     clickHandler: PropTypes.func,
   };
 
-  handleClick = () => {
-    this.props.clickHandler(this.props.name);
-  };
+  handleClick = () => {};
 
   render() {
killedBy: Button calls clickHandler on button click
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
src/component/Button.js:17:12
     this.props.clickHandler(this.props.name);
   };
 
-  render() {
-    const className = [
-      "component-button",
-      this.props.orange ? "orange" : "",
-      this.props.wide ? "wide" : "",
-    ];
-
-    return (
-      <div className={className.join(" ").trim()}>
-        <button onClick={this.handleClick}>{this.props.name}</button>
-      </div>
-    );
-  }
+  render() {}
 }
 
killedBy: Button renders button with correct name
statusReason: TestingLibraryElementError: Unable to find an element with the text: /AC/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Survived] StringLiteral
src/component/Button.js:21:25
     const className = [
       "component-button",
       this.props.orange ? "orange" : "",
-      this.props.wide ? "wide" : "",
+      this.props.wide ? "" : "",
     ];
 

[Survived] MethodExpression
src/component/Button.js:25:23
     ];
 
     return (
-      <div className={className.join(" ").trim()}>
+      <div className={className.join(" ")}>
         <button onClick={this.handleClick}>{this.props.name}</button>
       </div>

[Survived] StringLiteral
src/component/Button.js:25:38
     ];
 
     return (
-      <div className={className.join(" ").trim()}>
+      <div className={className.join("").trim()}>
         <button onClick={this.handleClick}>{this.props.name}</button>
       </div>
