[Survived] BlockStatement
src/component/App.js:14:31
     operation: null,
   };
 
-  handleClick = buttonName => {
-    this.setState(calculate(this.state, buttonName));
-  };
+  handleClick = buttonName => {};
 
   render() {

[Killed] BlockStatement
src/component/App.js:18:12
     this.setState(calculate(this.state, buttonName));
   };
 
-  render() {
-    return (
-      <div className="component-app">
-        <Display value={this.state.next || this.state.total || "0"} />
-        <ButtonPanel clickHandler={this.handleClick} />
-      </div>
-    );
-  }
+  render() {}
 }
 
killedBy: App renders without crashing
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Survived] LogicalOperator
src/component/App.js:21:25
   render() {
     return (
       <div className="component-app">
-        <Display value={this.state.next || this.state.total || "0"} />
+        <Display value={(this.state.next || this.state.total) && "0"} />
         <ButtonPanel clickHandler={this.handleClick} />
       </div>

[Survived] LogicalOperator
src/component/App.js:21:25
   render() {
     return (
       <div className="component-app">
-        <Display value={this.state.next || this.state.total || "0"} />
+        <Display value={this.state.next && this.state.total || "0"} />
         <ButtonPanel clickHandler={this.handleClick} />
       </div>
