[Killed] BlockStatement
src/component/ButtonPanel.js:12:31
     clickHandler: PropTypes.func,
   };
 
-  handleClick = buttonName => {
-    this.props.clickHandler(buttonName);
-  };
+  handleClick = buttonName => {};
 
   render() {
killedBy: ButtonPanel calls clickHandler on button click
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0
