[Killed] BlockStatement
src/component/Display.js:11:12
     value: PropTypes.string,
   };
 
-  render() {
-    return (
-      <div className="component-display">
-        <div>{this.props.value}</div>
-      </div>
-    );
-  }
+  render() {}
 }
 
killedBy: Display renders value correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: /123/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
