[Killed] BlockStatement
src/logic/calculate.js:16:28
  *   operation:String  +, -, etc.
  */
 export default function calculate(obj, buttonName) {
-  if (buttonName === "AC") {
-    return {
-      total: null,
-      next: null,
-      operation: null,
-    };
-  }
+  if (buttonName === "AC") {}
 
   if (isNumber(buttonName)) {
killedBy: calculate returns updated calculator data for AC button
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
    "next": null,
-   "operation": null,

[Killed] EqualityOperator
src/logic/calculate.js:16:7
  *   operation:String  +, -, etc.
  */
 export default function calculate(obj, buttonName) {
-  if (buttonName === "AC") {
+  if (buttonName !== "AC") {
     return {
       total: null,
killedBy: calculate returns updated calculator data for AC button
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
    "next": null,
-   "operation": null,

[Killed] ObjectLiteral
src/logic/calculate.js:17:12
  */
 export default function calculate(obj, buttonName) {
   if (buttonName === "AC") {
-    return {
-      total: null,
-      next: null,
-      operation: null,
-    };
+    return {};
   }
 
killedBy: calculate returns updated calculator data for AC button
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Object {
-   "next": null,
-   "operation": null,

[Killed] ConditionalExpression
src/logic/calculate.js:24:7
     };
   }
 
-  if (isNumber(buttonName)) {
+  if (true) {
     if (buttonName === "0" && obj.next === "0") {
       return {};
killedBy: calculate returns updated calculator data for operation button
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: "5-"

[Killed] BlockStatement
src/logic/calculate.js:24:29
     };
   }
 
-  if (isNumber(buttonName)) {
-    if (buttonName === "0" && obj.next === "0") {
-      return {};
-    }
-    // If there is an operation, update next
-    if (obj.operation) {
-      if (obj.next) {
-        return { next: obj.next + buttonName };
-      }
-      return { next: buttonName };
-    }
-    // If there is no operation, update next and clear the value
-    if (obj.next) {
-      const next = obj.next === "0" ? buttonName : obj.next + buttonName;
-      return {
-        next,
-        total: null,
-      };
-    }
-    return {
-      next: buttonName,
-      total: null,
-    };
-  }
+  if (isNumber(buttonName)) {}
 
   if (buttonName === "%") {
killedBy: calculate returns updated calculator data for number button
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "5"
Received: null

[Killed] ConditionalExpression
src/logic/calculate.js:25:9
   }
 
   if (isNumber(buttonName)) {
-    if (buttonName === "0" && obj.next === "0") {
+    if (true) {
       return {};
     }
killedBy: calculate returns updated calculator data for number button
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "5"
Received: undefined

[Survived] EqualityOperator
src/logic/calculate.js:25:31
   }
 
   if (isNumber(buttonName)) {
-    if (buttonName === "0" && obj.next === "0") {
+    if (buttonName === "0" && obj.next !== "0") {
       return {};
     }

[Killed] ConditionalExpression
src/logic/calculate.js:29:9
       return {};
     }
     // If there is an operation, update next
-    if (obj.operation) {
+    if (false) {
       if (obj.next) {
         return { next: obj.next + buttonName };
killedBy: calculate returns updated calculator data for number button
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: undefined
Received: null

[Killed] BlockStatement
src/logic/calculate.js:29:24
       return {};
     }
     // If there is an operation, update next
-    if (obj.operation) {
-      if (obj.next) {
-        return { next: obj.next + buttonName };
-      }
-      return { next: buttonName };
-    }
+    if (obj.operation) {}
     // If there is no operation, update next and clear the value
     if (obj.next) {
killedBy: calculate returns updated calculator data for number button
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: undefined
Received: null

[Killed] ConditionalExpression
src/logic/calculate.js:30:11
     }
     // If there is an operation, update next
     if (obj.operation) {
-      if (obj.next) {
+      if (true) {
         return { next: obj.next + buttonName };
       }
killedBy: calculate returns updated calculator data for number button
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "5"
Received: "null5"

[Survived] BlockStatement
src/logic/calculate.js:30:21
     }
     // If there is an operation, update next
     if (obj.operation) {
-      if (obj.next) {
-        return { next: obj.next + buttonName };
-      }
+      if (obj.next) {}
       return { next: buttonName };
     }

[Survived] ArithmeticOperator
src/logic/calculate.js:31:24
     // If there is an operation, update next
     if (obj.operation) {
       if (obj.next) {
-        return { next: obj.next + buttonName };
+        return { next: obj.next - buttonName };
       }
       return { next: buttonName };

[Survived] BlockStatement
src/logic/calculate.js:36:19
       return { next: buttonName };
     }
     // If there is no operation, update next and clear the value
-    if (obj.next) {
-      const next = obj.next === "0" ? buttonName : obj.next + buttonName;
-      return {
-        next,
-        total: null,
-      };
-    }
+    if (obj.next) {}
     return {
       next: buttonName,

[Survived] ConditionalExpression
src/logic/calculate.js:36:9
       return { next: buttonName };
     }
     // If there is no operation, update next and clear the value
-    if (obj.next) {
+    if (false) {
       const next = obj.next === "0" ? buttonName : obj.next + buttonName;
       return {

[Survived] ArithmeticOperator
src/logic/calculate.js:37:52
     }
     // If there is no operation, update next and clear the value
     if (obj.next) {
-      const next = obj.next === "0" ? buttonName : obj.next + buttonName;
+      const next = obj.next === "0" ? buttonName : obj.next - buttonName;
       return {
         next,

[Survived] EqualityOperator
src/logic/calculate.js:37:20
     }
     // If there is no operation, update next and clear the value
     if (obj.next) {
-      const next = obj.next === "0" ? buttonName : obj.next + buttonName;
+      const next = obj.next !== "0" ? buttonName : obj.next + buttonName;
       return {
         next,

[Survived] ObjectLiteral
src/logic/calculate.js:43:12
         total: null,
       };
     }
-    return {
-      next: buttonName,
-      total: null,
-    };
+    return {};
   }
 

[Killed] EqualityOperator
src/logic/calculate.js:49:7
     };
   }
 
-  if (buttonName === "%") {
+  if (buttonName !== "%") {
     if (obj.operation && obj.next) {
       const result = operate(obj.total, obj.next, obj.operation);
killedBy: calculate returns updated calculator data for operation button
statusReason: TypeError: (0 , _big.default)(...).div is not a function

[Killed] ConditionalExpression
src/logic/calculate.js:49:7
     };
   }
 
-  if (buttonName === "%") {
+  if (true) {
     if (obj.operation && obj.next) {
       const result = operate(obj.total, obj.next, obj.operation);
killedBy: calculate returns updated calculator data for operation button
statusReason: TypeError: (0 , _big.default)(...).div is not a function

[Survived] ConditionalExpression
src/logic/calculate.js:50:9
   }
 
   if (buttonName === "%") {
-    if (obj.operation && obj.next) {
+    if (false) {
       const result = operate(obj.total, obj.next, obj.operation);
       return {

[Survived] LogicalOperator
src/logic/calculate.js:50:9
   }
 
   if (buttonName === "%") {
-    if (obj.operation && obj.next) {
+    if (obj.operation || obj.next) {
       const result = operate(obj.total, obj.next, obj.operation);
       return {

[Survived] ObjectLiteral
src/logic/calculate.js:52:14
   if (buttonName === "%") {
     if (obj.operation && obj.next) {
       const result = operate(obj.total, obj.next, obj.operation);
-      return {
-        total: Big(result)
-          .div(Big("100"))
-          .toString(),
-        next: null,
-        operation: null,
-      };
+      return {};
     }
     if (obj.next) {

[Survived] ConditionalExpression
src/logic/calculate.js:60:9
         operation: null,
       };
     }
-    if (obj.next) {
+    if (true) {
       return {
         next: Big(obj.next)

[Survived] BlockStatement
src/logic/calculate.js:60:19
         operation: null,
       };
     }
-    if (obj.next) {
-      return {
-        next: Big(obj.next)
-          .div(Big("100"))
-          .toString(),
-      };
-    }
+    if (obj.next) {}
     return {};
   }

[Survived] ObjectLiteral
src/logic/calculate.js:61:14
       };
     }
     if (obj.next) {
-      return {
-        next: Big(obj.next)
-          .div(Big("100"))
-          .toString(),
-      };
+      return {};
     }
     return {};

[Survived] StringLiteral
src/logic/calculate.js:63:20
     if (obj.next) {
       return {
         next: Big(obj.next)
-          .div(Big("100"))
+          .div(Big(""))
           .toString(),
       };

[Killed] EqualityOperator
src/logic/calculate.js:70:7
     return {};
   }
 
-  if (buttonName === ".") {
+  if (buttonName !== ".") {
     if (obj.next) {
       // ignore a . if the next number already has one
killedBy: calculate returns updated calculator data for operation button
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: "5."

[Killed] ConditionalExpression
src/logic/calculate.js:70:7
     return {};
   }
 
-  if (buttonName === ".") {
+  if (true) {
     if (obj.next) {
       // ignore a . if the next number already has one
killedBy: calculate returns updated calculator data for operation button
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: "5."

[Survived] BlockStatement
src/logic/calculate.js:71:19
   }
 
   if (buttonName === ".") {
-    if (obj.next) {
-      // ignore a . if the next number already has one
-      if (obj.next.includes(".")) {
-        return {};
-      }
-      return { next: obj.next + "." };
-    }
+    if (obj.next) {}
     return { next: "0." };
   }

[Survived] ConditionalExpression
src/logic/calculate.js:71:9
   }
 
   if (buttonName === ".") {
-    if (obj.next) {
+    if (true) {
       // ignore a . if the next number already has one
       if (obj.next.includes(".")) {

[Survived] ConditionalExpression
src/logic/calculate.js:73:11
   if (buttonName === ".") {
     if (obj.next) {
       // ignore a . if the next number already has one
-      if (obj.next.includes(".")) {
+      if (false) {
         return {};
       }

[Survived] BlockStatement
src/logic/calculate.js:73:35
   if (buttonName === ".") {
     if (obj.next) {
       // ignore a . if the next number already has one
-      if (obj.next.includes(".")) {
-        return {};
-      }
+      if (obj.next.includes(".")) {}
       return { next: obj.next + "." };
     }

[Survived] ObjectLiteral
src/logic/calculate.js:78:12
       }
       return { next: obj.next + "." };
     }
-    return { next: "0." };
+    return {};
   }
 

[Survived] StringLiteral
src/logic/calculate.js:78:20
       }
       return { next: obj.next + "." };
     }
-    return { next: "0." };
+    return { next: "" };
   }
 

[Killed] ConditionalExpression
src/logic/calculate.js:81:7
     return { next: "0." };
   }
 
-  if (buttonName === "=") {
+  if (true) {
     if (obj.next && obj.operation) {
       return {
killedBy: calculate returns updated calculator data for operation button
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "-"
Received: null

[Killed] EqualityOperator
src/logic/calculate.js:81:7
     return { next: "0." };
   }
 
-  if (buttonName === "=") {
+  if (buttonName !== "=") {
     if (obj.next && obj.operation) {
       return {
killedBy: calculate returns updated calculator data for operation button
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "-"
Received: null

[Survived] ConditionalExpression
src/logic/calculate.js:82:9
   }
 
   if (buttonName === "=") {
-    if (obj.next && obj.operation) {
+    if (false) {
       return {
         total: operate(obj.total, obj.next, obj.operation),

[Survived] LogicalOperator
src/logic/calculate.js:82:9
   }
 
   if (buttonName === "=") {
-    if (obj.next && obj.operation) {
+    if (obj.next || obj.operation) {
       return {
         total: operate(obj.total, obj.next, obj.operation),

[Survived] BlockStatement
src/logic/calculate.js:88:12
         next: null,
         operation: null,
       };
-    } else {
-      // '=' with no operation, nothing to do
-      return {};
-    }
+    } else {}
   }
 

[Killed] ConditionalExpression
src/logic/calculate.js:94:7
     }
   }
 
-  if (buttonName === "+/-") {
+  if (true) {
     if (obj.next) {
       return { next: (-1 * parseFloat(obj.next)).toString() };
killedBy: calculate returns updated calculator data for operation button
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: "-5"

[Killed] EqualityOperator
src/logic/calculate.js:94:7
     }
   }
 
-  if (buttonName === "+/-") {
+  if (buttonName !== "+/-") {
     if (obj.next) {
       return { next: (-1 * parseFloat(obj.next)).toString() };
killedBy: calculate returns updated calculator data for operation button
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: "-5"

[Survived] BlockStatement
src/logic/calculate.js:95:19
   }
 
   if (buttonName === "+/-") {
-    if (obj.next) {
-      return { next: (-1 * parseFloat(obj.next)).toString() };
-    }
+    if (obj.next) {}
     if (obj.total) {
       return { total: (-1 * parseFloat(obj.total)).toString() };

[Survived] ConditionalExpression
src/logic/calculate.js:95:9
   }
 
   if (buttonName === "+/-") {
-    if (obj.next) {
+    if (true) {
       return { next: (-1 * parseFloat(obj.next)).toString() };
     }

[Survived] UnaryOperator
src/logic/calculate.js:96:23
 
   if (buttonName === "+/-") {
     if (obj.next) {
-      return { next: (-1 * parseFloat(obj.next)).toString() };
+      return { next: (+1 * parseFloat(obj.next)).toString() };
     }
     if (obj.total) {

[Survived] ArithmeticOperator
src/logic/calculate.js:96:23
 
   if (buttonName === "+/-") {
     if (obj.next) {
-      return { next: (-1 * parseFloat(obj.next)).toString() };
+      return { next: (-1 / parseFloat(obj.next)).toString() };
     }
     if (obj.total) {

[Survived] BlockStatement
src/logic/calculate.js:98:20
     if (obj.next) {
       return { next: (-1 * parseFloat(obj.next)).toString() };
     }
-    if (obj.total) {
-      return { total: (-1 * parseFloat(obj.total)).toString() };
-    }
+    if (obj.total) {}
     return {};
   }

[Survived] ConditionalExpression
src/logic/calculate.js:98:9
     if (obj.next) {
       return { next: (-1 * parseFloat(obj.next)).toString() };
     }
-    if (obj.total) {
+    if (false) {
       return { total: (-1 * parseFloat(obj.total)).toString() };
     }

[Survived] UnaryOperator
src/logic/calculate.js:99:24
       return { next: (-1 * parseFloat(obj.next)).toString() };
     }
     if (obj.total) {
-      return { total: (-1 * parseFloat(obj.total)).toString() };
+      return { total: (+1 * parseFloat(obj.total)).toString() };
     }
     return {};

[Survived] ArithmeticOperator
src/logic/calculate.js:99:24
       return { next: (-1 * parseFloat(obj.next)).toString() };
     }
     if (obj.total) {
-      return { total: (-1 * parseFloat(obj.total)).toString() };
+      return { total: (-1 / parseFloat(obj.total)).toString() };
     }
     return {};

[Killed] ConditionalExpression
src/logic/calculate.js:113:7
   // }
 
   // User pressed an operation button and there is an existing operation
-  if (obj.operation) {
+  if (false) {
     return {
       total: operate(obj.total, obj.next, obj.operation),
killedBy: calculate returns updated calculator data for operation button
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: undefined
Received: "5"

[Killed] BlockStatement
src/logic/calculate.js:113:22
   // }
 
   // User pressed an operation button and there is an existing operation
-  if (obj.operation) {
-    return {
-      total: operate(obj.total, obj.next, obj.operation),
-      next: null,
-      operation: buttonName,
-    };
-  }
+  if (obj.operation) {}
 
   // no operation yet, but the user typed one
killedBy: calculate returns updated calculator data for operation button
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: undefined
Received: "5"

[Survived] ConditionalExpression
src/logic/calculate.js:124:7
   // no operation yet, but the user typed one
 
   // The user hasn't typed a number yet, just save the operation
-  if (!obj.next) {
+  if (false) {
     return { operation: buttonName };
   }

[Survived] ConditionalExpression
src/logic/calculate.js:124:7
   // no operation yet, but the user typed one
 
   // The user hasn't typed a number yet, just save the operation
-  if (!obj.next) {
+  if (true) {
     return { operation: buttonName };
   }
