[Killed] BlockStatement
src/logic/isNumber.js:1:40
-export default function isNumber(item) {
-  return /[0-9]+/.test(item);
-}
+export default function isNumber(item) {}
 
killedBy: calculate returns updated calculator data for number button
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "5"
Received: null
