[Survived] BlockStatement
src/logic/operate.js:3:66
 import Big from "big.js";
 
-export default function operate(numberOne, numberTwo, operation) {
-  const one = Big(numberOne || "0");
-  const two = Big(numberTwo || (operation === "÷" || operation === 'x' ? "1": "0")); //If dividing or multiplying, then 1 maintains current value in cases of null
-  if (operation === "+") {
-    return one.plus(two).toString();
-  }
-  if (operation === "-") {
-    return one.minus(two).toString();
-  }
-  if (operation === "x") {
-    return one.times(two).toString();
-  }
-  if (operation === "÷") {
-    if (two === "0") {
-      alert("Divide by 0 error");
-      return "0";
-    } else {
-      return one.div(two).toString();
-    }
-  }
-  throw Error(`Unknown operation '${operation}'`);
-}
+export default function operate(numberOne, numberTwo, operation) {}
 

[Survived] ConditionalExpression
src/logic/operate.js:4:19
 import Big from "big.js";
 
 export default function operate(numberOne, numberTwo, operation) {
-  const one = Big(numberOne || "0");
+  const one = Big(true);
   const two = Big(numberTwo || (operation === "÷" || operation === 'x' ? "1": "0")); //If dividing or multiplying, then 1 maintains current value in cases of null
   if (operation === "+") {

[Survived] ConditionalExpression
src/logic/operate.js:4:19
 import Big from "big.js";
 
 export default function operate(numberOne, numberTwo, operation) {
-  const one = Big(numberOne || "0");
+  const one = Big(false);
   const two = Big(numberTwo || (operation === "÷" || operation === 'x' ? "1": "0")); //If dividing or multiplying, then 1 maintains current value in cases of null
   if (operation === "+") {

[Survived] ConditionalExpression
src/logic/operate.js:5:33
 
 export default function operate(numberOne, numberTwo, operation) {
   const one = Big(numberOne || "0");
-  const two = Big(numberTwo || (operation === "÷" || operation === 'x' ? "1": "0")); //If dividing or multiplying, then 1 maintains current value in cases of null
+  const two = Big(numberTwo || (false ? "1": "0")); //If dividing or multiplying, then 1 maintains current value in cases of null
   if (operation === "+") {
     return one.plus(two).toString();

[Survived] ConditionalExpression
src/logic/operate.js:5:33
 
 export default function operate(numberOne, numberTwo, operation) {
   const one = Big(numberOne || "0");
-  const two = Big(numberTwo || (operation === "÷" || operation === 'x' ? "1": "0")); //If dividing or multiplying, then 1 maintains current value in cases of null
+  const two = Big(numberTwo || (false || operation === 'x' ? "1": "0")); //If dividing or multiplying, then 1 maintains current value in cases of null
   if (operation === "+") {
     return one.plus(two).toString();

[Survived] EqualityOperator
src/logic/operate.js:6:7
 export default function operate(numberOne, numberTwo, operation) {
   const one = Big(numberOne || "0");
   const two = Big(numberTwo || (operation === "÷" || operation === 'x' ? "1": "0")); //If dividing or multiplying, then 1 maintains current value in cases of null
-  if (operation === "+") {
+  if (operation !== "+") {
     return one.plus(two).toString();
   }

[Survived] ConditionalExpression
src/logic/operate.js:6:7
 export default function operate(numberOne, numberTwo, operation) {
   const one = Big(numberOne || "0");
   const two = Big(numberTwo || (operation === "÷" || operation === 'x' ? "1": "0")); //If dividing or multiplying, then 1 maintains current value in cases of null
-  if (operation === "+") {
+  if (false) {
     return one.plus(two).toString();
   }

[Survived] ConditionalExpression
src/logic/operate.js:9:7
   if (operation === "+") {
     return one.plus(two).toString();
   }
-  if (operation === "-") {
+  if (false) {
     return one.minus(two).toString();
   }

[Survived] BlockStatement
src/logic/operate.js:9:26
   if (operation === "+") {
     return one.plus(two).toString();
   }
-  if (operation === "-") {
-    return one.minus(two).toString();
-  }
+  if (operation === "-") {}
   if (operation === "x") {
     return one.times(two).toString();

[Survived] ConditionalExpression
src/logic/operate.js:12:7
   if (operation === "-") {
     return one.minus(two).toString();
   }
-  if (operation === "x") {
+  if (true) {
     return one.times(two).toString();
   }

[Survived] BlockStatement
src/logic/operate.js:12:26
   if (operation === "-") {
     return one.minus(two).toString();
   }
-  if (operation === "x") {
-    return one.times(two).toString();
-  }
+  if (operation === "x") {}
   if (operation === "÷") {
     if (two === "0") {

[Survived] EqualityOperator
src/logic/operate.js:15:7
   if (operation === "x") {
     return one.times(two).toString();
   }
-  if (operation === "÷") {
+  if (operation !== "÷") {
     if (two === "0") {
       alert("Divide by 0 error");

[Survived] BlockStatement
src/logic/operate.js:15:26
   if (operation === "x") {
     return one.times(two).toString();
   }
-  if (operation === "÷") {
-    if (two === "0") {
-      alert("Divide by 0 error");
-      return "0";
-    } else {
-      return one.div(two).toString();
-    }
-  }
+  if (operation === "÷") {}
   throw Error(`Unknown operation '${operation}'`);
 }

[Survived] ConditionalExpression
src/logic/operate.js:16:9
     return one.times(two).toString();
   }
   if (operation === "÷") {
-    if (two === "0") {
+    if (true) {
       alert("Divide by 0 error");
       return "0";

[Survived] EqualityOperator
src/logic/operate.js:16:9
     return one.times(two).toString();
   }
   if (operation === "÷") {
-    if (two === "0") {
+    if (two !== "0") {
       alert("Divide by 0 error");
       return "0";

[Survived] BlockStatement
src/logic/operate.js:19:12
     if (two === "0") {
       alert("Divide by 0 error");
       return "0";
-    } else {
-      return one.div(two).toString();
-    }
+    } else {}
   }
   throw Error(`Unknown operation '${operation}'`);

[Survived] StringLiteral
src/logic/operate.js:23:15
       return one.div(two).toString();
     }
   }
-  throw Error(`Unknown operation '${operation}'`);
+  throw Error(``);
 }
 
